def get_hex(ch):
    fch = ""
    for j in ch:
        if fch == "":
            fch+=f"ChrW({ord(j)})"
        else:
            fch+=f" & ChrW({ord(j)})"
    return fch


numbers = [
    "शुन्य", "एक", "दुई", "तीन", "चार", "पाँच", "छ", "सात", "आठ", "नौ","दश",
    "एघार", "बाह्र", "तेह्र", "चौध","पन्ध्र","सोह्र","सत्र","अठार","उन्नाइस","बिस",
    "एक्काइस","बाइस","तेइस","चौबिस","पच्चिस","छब्बिस","सत्ताइस","अट्ठाइस","उनन्तिस","तिस",
    "एकतिस","बत्तिस","तेत्तिस","चौतिस","पैँतिस","छत्तिस","सैँतिस","अठतिस","उनन्चालिस","चालिस",
    "एकचालिस","बयालिस","त्रिचालिस","चवालिस","पैँतालिस","छयालिस","सतचालिस","अठ्चालिस","उनन्चास","पचास",
    "एकाउन्न","बाउन्न","त्रिपन्न","चौवन्न","पचपन्न","छपन्न","सन्ताउन्न","अन्ठाउन्न","उन्साट्ठी","साठी",
    "एकसट्ठी","बैसट्ठी","त्रिसट्ठी","चौसट्ठी","पैँसट्ठी","छयसट्ठी","सतसट्ठी","अठसट्ठी","उनन्सत्तरी","सत्तरी",
    "एकहत्तर","बहतर","त्रिहत्तर","चौहत्तर","पचहत्तर","छयत्तर","सतहत्तर","अठहत्तर","उनासी","असी",
    "एकासी","बयासी","त्रियासी","चौरासी","पचासी","छयासी","सतासी","अठासी","उनान्नब्बे","नब्बे",
    "एकान्नब्बे","बयान्नब्बे","त्रियान्नब्बे","चौरान्नब्बे","पन्चान्नब्बे","छयान्नब्बे","सन्तान्नब्बे","अन्ठान्नब्बे","उनान्सय"
]

specials = [
    " सय "," हजार ", " लाख "," करोड "," अरब "," खरब "
]

total_length = sum([len(get_hex(i)) for i in numbers])

with open("NepaliNumerics.bas", "w") as f:
    with open("first_part.txt", "r") as fp:
        text = fp.read()
    f.write(text)
    text = ""
    length = 0
    previous = 0

    for count, num in enumerate(numbers):
        length += len(get_hex(num))
        if length > 700:
            f.write(", ".join(get_hex(i) for i in numbers[previous:count]))
            f.write(", _\n\t\t\t\t\t\t")

            previous = count
            length = 0

    f.write(", ".join(get_hex(i) for i in numbers[previous:count+1]))
    f.write(")\n\n\tSpecials = Array(")
    f.write(", ".join(get_hex(i) for i in specials))
    f.write(")")

    with open("second_part.txt", "r") as sp:
        text = sp.read()
    f.write(text)